{"_id":{"$oid":"561cf515d293d4d2177e20d5"},"__v":0,"body":"\u003cp\u003eTento článek pojednává o instalaci NodeJS na vlastním Virtual Private Serveru (VPS). Pokud nevíte, co NodeJS je, můžete si přečíst proč se vůbec o NodeJS zajímat na \u003ca href=\\\"http://weblog.ronnieweb.net/2012/01/proc-nodejs/\\\"\u003etomto odkazu\u003c/a\u003e. Pokud chcete NodeJS pouze nainstalovat na svém vlastním počítači a vyzkoušet ho lokálně, přečtěte si článek \u003ca href=\"/post/instalace-nodejs-na-localhostu\"\u003eJak nainstalovat NodeJS\u003c/a\u003e. V případě, že vás zajímá jak si zařídit VPS a kolik takový VPS stojí, v článku \u003ca href=\\\"http://weblog.ronnieweb.net/2012/01/proc-nodejs/\\\"\u003eJak na VPS\u003c/a\u003e se dozvíte více.\u003c/p\u003e\r\n\r\n\u003cp\u003eTeď už ale pojďme k věci. NodeJS je ve světě hodně populární, v česku bohužel zatím není moc známý. Z toho i plyne, že hledat český hosting pro NodeJS je bída. Tak například \u003ca href=\\\"https://rosti.cz/cenik/\\\"\u003eRoští\u003c/a\u003e nabízí za 26 korun za měsíc 64MB RAM s 1GB prostorem, což unese velmi jednoduchou NodeJS aplikaci. Je tady ale jiná varianta, malinko složitější \u0026mdash; udržování vlastního VPS. Třeba takový Forpsi VPS vyjde na 25 Kč za měsíc. Za tuto cenu uživatel dostane 1GB RAM + 20GB prostoru, což už je podle mě velmi dobrá nabídka. S DPH vás to vyjde na 360 Kč ročně, což je srovnatelné s cenou jednodoménového hostingu u Wedosu. Na vašem VPS můžete hostovat ale domén (webů) kolik chcete (samozřejmě omezené místem na disku a RAM) a všechno si nastavíte tak, jak chcete vy. NodeJS může dokonce běžet spolu s Apache (LAMP).\u003c/p\u003e\r\n\r\n\u003ch2\u003eÚvod\u003c/h2\u003e\r\n\u003cp\u003eTento návod bude fungovat na VPS Serveru, který má přednainstalovaný Ubuntu Server 14.04. Návod by měl být ale platný pro kterýkoliv unixový server. Ve své podstatě nainstalujeme nejenom NodeJS, ale i Nginx, který nám zajístí proxy. Znamená to, že budeme mít například dvě NodeJS aplikace: app1.cz a app2.cz. Nginx nasměruje po zadání domén do prohlížeče požadavky do správných složek na serveru.\u003c/p\u003e\r\n\r\n\u003ch2\u003eBezpečný nový uživatel\u003c/h2\u003e\r\n\u003cp\u003eNebylo by moc rozumné spouštět web aplikace jako root uživatel, protože v případě napadení hackerem by hacker mohl převzít kontrolu nad celým VPS (a to nechceme). Proto si nejprve vytvoříme bezpečného uživatele, který bude mít sudo privilegia, tudíž bude schopný instalovat různé balíčky jako root. Otevřete si okno terminálu (TODO: Jak na terminál ve Windowsu) a přihlašte se jako root na vaše VPS\u003c/p\u003e\r\n\r\n\u003cpre\u003e\u003ccode class=\"bash\"\u003essh root@ip_adresa_vps\u003c/code\u003e\u003c/pre\u003e\r\n\r\n\u003cp\u003eNyní si vytvoříme nového uživatele se jménem \"web\" a jeho složku. Můžete ho nazvat samozřejmě jakkoliv chcete.\u003c/p\u003e\r\n\r\n\u003cpre\u003e\u003ccode class=\"bash\"\u003euseradd -s /bin/bash -m -d /home/web -c \"web\" web\u003c/code\u003e\u003c/pre\u003e\r\n\r\n\u003cp\u003eNastavíme na tomto uživateli heslo.\u003c/p\u003e\r\n\r\n\u003cpre\u003e\u003ccode class=\"bash\"\u003epasswd web\u003c/code\u003e\u003c/pre\u003e\r\n\r\n\u003cp\u003eA nakonec přiřadíme sudo privilegia, abychom mohli používat příkazy jako root.\u003c/p\u003e\r\n\r\n\u003cpre\u003e\u003ccode class=\"bash\"\u003eusermod -aG sudo web\u003c/code\u003e\u003c/pre\u003e\r\n\r\n\u003cp\u003ePo tomto procesu se odhlásíme a podobně jako s rootem se přihlásíme s novým uživatelem \"web\".\u003c/p\u003e\r\n\r\n\u003cpre\u003e\u003ccode class=\"bash\"\u003essh web@ip_adresa_vps\u003c/code\u003e\u003c/pre\u003e\r\n\r\n\u003ch2\u003eInstalace NodeJS\u003c/h2\u003e\r\n\r\n\u003cp\u003eNyní si nainstalujeme poslední verzi NodeJS. Nejprve updatujeme všechny balíčky\u003c/p\u003e\r\n\r\n\u003cpre\u003e\u003ccode class=\"bash\"\u003esudo apt-get update\u003c/code\u003e\u003c/pre\u003e\r\n\r\n\u003cp\u003eNásledovně nainstalujeme balíčky, které jsou potřebné pro NodeJS\u003c/p\u003e\r\n\r\n\u003cpre\u003e\u003ccode class=\"bash\"\u003esudo apt-get install -y build-essential openssl libssl-dev pkg-config\u003c/code\u003e\u003c/pre\u003e\r\n\r\n\u003cp\u003eNyní si stáhneme NodeJS z jejich webu a rozbalíme ho. Poté se přesuneme do složky s rozbaleným NodeJS.\u003c/p\u003e\r\n\r\n\u003cpre\u003e\u003ccode class=\"bash\"\u003ewget https://nodejs.org/dist/v0.12.5/node-v0.12.5.tar.gz\r\ntar xvf node-v*\r\ncd node-v*\u003c/code\u003e\u003c/pre\u003e\r\n\r\n\u003cp\u003eNakonfigurujeme NodeJS a \"postavíme\", nakonec takto nakonfigurované a postavené NodeJS si nainstalujeme.\u003c/p\u003e\r\n\r\n\u003cpre\u003e\u003ccode class=\"bash\"\u003e./configure\r\nmake\r\nsudo make install\u003c/code\u003e\u003c/pre\u003e\r\n\r\n\u003ch2\u003ePrvní testovací NodeJS aplikace s Expressem\u003c/h2\u003e\r\n\u003cp\u003eVytvořte si v domovském adresáři /home/web/ novou složku \"node-test\". Uvnitř této složky vytvořte soubor node-test.js, který necháte teď prázdný. Pomocí příkazu npm init si vytvořte soubor package.json. Příkaz npm init se vás vyptá na několik informací, nejdůležitější je ale specifikovat startovací soubor (entry  point), který je právě node-test.js. Zbytek můžete nechat jako default. Nakonec ještě nainstalujte Express framework.\u003c/p\u003e\r\n\r\n\u003cpre\u003e\u003ccode class=\"bash\"\u003emkdir node-test\r\ncd node-test\r\nnano node-test.js\r\nnpm init\r\n...\r\nnpm install express --save\u003c/code\u003e\u003c/pre\u003e\r\n\r\n\u003cp\u003eNyní máme vše připraveno pro vytvoření rychlé testovací aplikace. Otevřete si soubor node-test, například pomocí editoru nano a vložte následující kód (pozor, v terminalu se nepoužívá ctrl+v ale ctrl+shift+v, ctrl+v totiž stornuje operace).\u003c/p\u003e\r\n\r\n\u003cpre\u003e\u003ccode class=\"js\"\u003evar express = require('express')\r\nvar app = express()\r\n\r\napp.get('/', function (req, res) {\r\n  res.send('Tady běží testovací aplikace')\r\n})\r\n\r\nvar server = app.listen(8080, function (err) {\r\n  if(err)\r\n  \u0009console.log(err)\r\n  else\r\n  \u0009console.log('App is working on port 8080')\r\n})\u003c/code\u003e\u003c/pre\u003e\r\n\r\n\u003cp\u003eNemohli jste si nevšimnout, že tam nejsou žádné středníky. To je krása javascriptu, tam se psát nemusí. Uložte tento soubor a zadejte následující příkaz, který aplikaci spustí na portu 8080. Poté stačí pouze zabrouzdat ve vašem prohlížeči na adresu http://ip_vaseho_vps:8080 a vaše aplikace tam už na vás bude čekat. Asi vás napadlo jak spustit několik NodeJS aplikací najednou když musíte zrušit (pomocí ctrl+c) tuto aplikaci, abyste mohli spustit další. Na to je tady pomocník zvaný forever.js. \u003ca href=\"#\"\u003ePřečtěte si jak nainstalovat a nakonfigurovat forever\u003c/a\u003e, aby aplikace běžely opravdu \"forever\".\u003c/p\u003e\r\n\r\n\u003cpre\u003e\u003ccode class=\"js\"\u003enode node-test.js\u003c/code\u003e\u003c/pre\u003e\r\n\r\n\u003ch2\u003eVíce NodeJS aplikací na jednom VPS\u003c/h2\u003e\r\n\r\n\u003cp\u003eJak jde vidět, instalace a spuštění NodeJS na VPS není žádná raketová věda. Určitě ale nechceme, abychom prezentovali náš web/webovou aplikaci pomocí ip adresy našeho serveru s portem, to by se asi nikomu nelíbilo. Jistě máte také plány vytvořit více než jednu aplikaci. Proto je tady nginx, který nám pomůže nasměřovat požadavky, např. app1.cz a app2.cz do složek (a portů), kde máme napsané (a běží) naše webové aplikace. O instalaci a nakonfigurování nginxu se \u003ca href=\"#\"\u003edočtete zde\u003c/a\u003e\u003c/p\u003e\r\n\r\n\u003ch2\u003eReference\u003c/h2\u003e\r\n\u003col\u003e\r\n\u003cli\u003e\u003ca href=\"http://expressjs.com/starter/hello-world.html\"\u003ehttp://expressjs.com/starter/hello-world.html\u003c/a\u003e\u003c/li\u003e\r\n\u003cli\u003e\u003ca href=\"https://www.digitalocean.com/community/tutorials/how-to-use-pm2-to-setup-a-node-js-production-environment-on-an-ubuntu-vps\"\u003ehttps://www.digitalocean.com/community/tutorials/how-to-use-pm2-to-setup-a-node-js-production-environment-on-an-ubuntu-vps\u003c/a\u003e\u003c/li\u003e\r\n\u003cli\u003e\u003ca href=\"https://www.digitalocean.com/community/tutorials/how-to-set-up-a-node-js-application-for-production-on-ubuntu-14-04\"\u003ehttps://www.digitalocean.com/community/tutorials/how-to-set-up-a-node-js-application-for-production-on-ubuntu-14-04\u003c/a\u003e\u003c/li\u003e\r\n\u003c/ol\u003e","datetime":{"$date":"2015-10-13T12:12:05.064Z"},"name":"Instalace NodeJS na vlastní VPS","nameUrl":"instalace-nodejs-na-vlastni-vps","removed":false,"subheading":"Jak nainstalovat NodeJS na vlastním Virtual Private Serveru.","userId":"Emil Cieslar","labelIds":[{"$oid":"561e5ad2bdff7b611262766d"},{"$oid":"561e5ae7bdff7b611262766f"}]}
{"_id":{"$oid":"561d24481daf75bb1d3e9ba7"},"__v":0,"body":"\u003cp\u003eTento článek vysvětluje jak lze NodeJS nainstalovat na vašem počítači a aplikace následně spouštět přes localhost ve vašem prohlížeči. Pokud nevíte, co NodeJS je, můžete si přečíst proč se vůbec o NodeJS zajímat na \u003ca href=\"http://weblog.ronnieweb.net/2012/01/proc-nodejs/\"\u003etomto odkazu\u003c/a\u003e.\u003c/p\u003e\r\n\r\n\u003ch2\u003eÚvod\u003c/h2\u003e\r\n\r\n\u003cp\u003eMožná si říkáte, že NodeJS není pro vás. Je to pro programování webových aplikací a vy chcete klasické Apache + PHP + MySQL, které funguje na kterémkoliv hostingu na internetu. Možná máte pravdu, ale i přesto stojí za to to vyzkoušet. Možná budete překvapení, že i váš jednoduchý web může běžet na NodeJS a pokud byste ho chtěli rozšířit, bude to jednodušší než s PHP. Kupříkladu tento web běží celý na NodeJS a nepoznali byste to. Kdybych ho měl programovat v PHP (a taky jsem to už několikrát dělal), neudělal bych to rychleji než s NodeJS. Pojďme se tedy podívat jak NodeJS nainstalovat u vás na počítači.\u003c/p\u003e\r\n\r\n\u003ch2\u003eInstalace NodeJS na Ubuntu\u003c/h2\u003e\r\n\u003cp\u003eNyní si nainstalujeme poslední verzi NodeJS. Nejprve stáhneme potřebné balíčky pro běh NodeJS.\u003c/p\u003e\r\n\r\n\u003cpre\u003e\u003ccode class=\"bash\"\u003ecurl --silent --location https://deb.nodesource.com/setup_4.x | sudo bash -\u003c/code\u003e\u003c/pre\u003e\r\n\r\n\u003cp\u003eNásledovně nainstalujeme NodeJS\u003c/p\u003e\r\n\r\n\u003cpre\u003e\u003ccode class=\"bash\"\u003esudo apt-get install --yes nodejs\u003c/code\u003e\u003c/pre\u003e\r\n\r\n\u003ch2\u003eInstalace NodeJS na Debian\u003c/h2\u003e\r\n\u003cp\u003ePostup je prakticky totožný s Ubuntu, pouze jsou příkazy malinko odlišné\u003c/p\u003e\r\n\r\n\u003cpre\u003e\u003ccode class=\"bash\"\u003eapt-get install curl\r\ncurl --silent --location https://deb.nodesource.com/setup_4.x | bash -\r\napt-get install --yes nodejs\u003c/code\u003e\u003c/pre\u003e\r\n\r\n\u003ch2\u003eInstalace NodeJS na Windowsu\u003c/h2\u003e\r\n\r\n\u003cp\u003eZ následujícího odkazu si stáhněte instalační soubor pro vaši verzi Windowsu \u003ca href=\"https://nodejs.org/en/download/\"\u003ehttps://nodejs.org/en/download/\u003c/a\u003e a nainstalujte ho. To je v podsatě vše. Samozřejmě pro spouštění aplikací by bylo mít ideálně nainstalovaný \u003ca href=\"https://cygwin.com/install.html\"\u003eCygwin\u003c/a\u003e, který simuluje unixový terminál.\u003c/p\u003e\r\n\r\n\u003ch2\u003eInstalace NodeJS na Mac OS X\u003c/h2\u003e\r\n\u003cp\u003ePostup je prakticky totožný s Windowsem. Z výše uvedeného odkazu si stáhnete instalační balíček pro vaši verzi Mac OS X a nainstalujete NodeJS.\r\n\r\n\u003ch2\u003ePrvní testovací NodeJS aplikace s Expressem\u003c/h2\u003e\r\n\u003cp\u003eNásledující je rychlý popis příkazů, které jsou uvedené níže a budete je vkládat do terminalu. Vytvoříte si kdekoliv v počítači novou složku \"node-test\". Uvnitř této složky vytvoříte soubor node-test.js, který necháte teď prázdný. Pomocí příkazu npm init si vygenerujete soubor package.json. Příkaz npm init se vás vyptá na několik informací, nejdůležitější je ale specifikovat startovací soubor (entry  point), který je právě node-test.js. Zbytek můžete nechat jako default. Nakonec ještě nainstalujete Express framework, který je takřka standardem v komunitě NodeJS pro tvorbu aplikací NodeJS.\u003c/p\u003e\r\n\r\n\u003cpre\u003e\u003ccode class=\"bash\"\u003emkdir node-test\r\ncd node-test\r\nnano node-test.js\r\nnpm init\r\n...\r\nnpm install express --save\u003c/code\u003e\u003c/pre\u003e\r\n\r\n\u003cp\u003eNyní máme vše připraveno pro vytvoření rychlé testovací aplikace. Otevřete si soubor node-test, například pomocí editoru nano a vložte následující kód (pozor, v terminalu se nepoužívá ctrl+v ale ctrl+shift+v, ctrl+v totiž stornuje operace).\u003c/p\u003e\r\n\r\n\u003cpre\u003e\u003ccode class=\"js\"\u003evar express = require('express')\r\nvar app = express()\r\n\r\napp.get('/', function (req, res) {\r\n  res.send('Tady běží testovací aplikace')\r\n})\r\n\r\nvar server = app.listen(3000, function (err) {\r\n  if(err)\r\n  \u0009console.log(err)\r\n  else\r\n  \u0009console.log('Aplikace běží na portu 3000')\r\n})\u003c/code\u003e\u003c/pre\u003e\r\n\r\n\u003cp\u003eNemohli jste si nevšimnout, že tam nejsou žádné středníky. To je krása javascriptu, tam se psát nemusí. Uložte tento soubor a zadejte následující příkaz, který aplikaci spustí na portu 3000. Poté stačí pouze zabrouzdat ve vašem prohlížeči na adresu http://localhost:3000 a vaše aplikace tam už na vás bude čekat.\u003c/p\u003e\r\n\r\n\u003cpre\u003e\u003ccode class=\"js\"\u003enode node-test.js\u003c/code\u003e\u003c/pre\u003e\r\n\r\n\u003cp\u003ePokud máte dotazy nebo vám něco nefunguje, zabrouzdejte do sekce \u003ca href=\"/contact\"\u003ekontakt\u003c/a\u003e a zanechte mi zprávu.\u003c/p\u003e\r\n\r\n\u003ch2\u003eReference\u003c/h2\u003e\r\n\r\n\u003col\u003e\r\n\u003cli\u003e\u003ca href=\"https://nodejs.org/en/download/package-manager/#debian-and-ubuntu-based-linux-distributions\"\u003ehttps://nodejs.org/en/download/package-manager/#debian-and-ubuntu-based-linux-distributions\u003c/a\u003e\u003c/li\u003e\r\n\u003c/ol\u003e","datetime":{"$date":"2015-10-13T15:33:28.692Z"},"name":"Instalace NodeJS na localhostu","nameUrl":"instalace-nodejs-na-localhostu","removed":false,"subheading":"Jak nainstalovat NodeJS na vašem počítači, aby běžel na localhostu.","userId":"Emil Cieslar","labelIds":[{"$oid":"561e5ad2bdff7b611262766d"},{"$oid":"561e5adebdff7b611262766e"}]}
{"_id":{"$oid":"561e48515a031a173a3a2c6c"},"name":"Instalace Forever.js","nameUrl":"instalace-forever.js","subheading":"Jak nainstalovat Forever.js, který zanechá běžet aplikace v pozadí","body":"\u003cp\u003ePokud jste si přečetli článek \u003ca href=\"/post/instalace-nodejs-na-vlastni-vps\"\u003eInstalace NodeJS na vlastní VPS\u003c/a\u003e určitě už víte, že abychom mohli mít několik aplikací spuštěných najednou, potřebujeme forever.js. Bez forever.js bychom museli každou aplikaci spustit pomocí příkazu \u003cspan class=\"label label-default\"\u003enode jmenoaplikace.js\u003c/span\u003e a pro každou mít zvlášť okno terminálu. Pokud by vám tato nepohodlnost nevadila, tak je tady další. Když aplikace spadne v důsledku nějaké chyby, příkaz \u003cspan class=\"label label-default\"\u003enode\u003c/span\u003e ji nerestartuje. Pojďme se tedy podívat jak nainstalovat forever.js, aby aplikace opravdu běžely neustále.\u003c/p\u003e\r\n\r\n\u003ch2\u003eInstalace forever.js\u003c/h2\u003e\r\n\u003cp\u003eInstalace je tak jednoduchá jako následující příkaz. Tento příkaz nainstaluje forever globálně, tudíž bude dostupný všem aplikacím v systému. Někdy je zapotřebí ke globálním instalacím dát před příkaz sudo, takže pokud uvidíte chybu a forever se nenainstaluje správně, zkuste přidat před příkaz sudo.\u003c/p\u003e\r\n\r\n\u003cpre\u003e\u003ccode class=\"bash\"\u003enpm install forever -g\u003c/code\u003e\u003c/pre\u003e\r\n\r\n\u003cp\u003ePokud chceme nějakou aplikaci na serveru spustit, stačí zadat následující příkaz.\u003c/p\u003e\r\n\r\n\u003cpre\u003e\u003ccode class=\"bash\"\u003eforever start --spinSleepTime 10000 aplikace1.js\u003c/code\u003e\u003c/pre\u003e\r\n\r\n\u003cp\u003eJe tady ale jeden problém. V případě, že vaše VPS restartujete nebo bude nenadálý výpadek, aplikace se automaticky nespustí. Proto je zapotřebí vytvořit startovací script, který se zapne při spuštění serveru. Vytvořte si tedy soubor start.sh, například pomocí příkazu \u003cspan class=\"label label-default\"\u003enano ~/start.sh\u003c/span\u003e a zkopírujte do editoru následující script. Na vysvětlenou, /var/www/aplikace1 je adresář, ve kterém máte svou aplikaci a aplikace1.js je spouštěcí soubor této aplikace.\u003c/p\u003e\r\n\r\n\u003cpre\u003e\u003ccode class=\"bash\"\u003e#!/bin/sh\r\n \r\nif [ $(ps -e -o uid,cmd | grep $UID | grep node | grep -v grep | wc -l | tr -s \"\\n\") -eq 0 ]\r\nthen\r\n        export PATH=/usr/local/bin:$PATH\r\n        forever start --spinSleepTime 10000 --sourceDir /var/www/aplikace1 aplikace1.js \u003e\u003e /var/www/aplikace1/log.txt 2\u003e\u00261\r\nfi\u003c/code\u003e\u003c/pre\u003e\r\n\r\n\u003cp\u003eUložte a ukončete nano editor a vložte následujicí dva příkazy, které zajístí, že se script spustí při startu.\u003c/p\u003e\r\n\r\n\u003cpre\u003e\u003ccode class=\"bash\"\u003ecrontab -e\r\n@reboot /path/to/starter.sh\u003c/code\u003e\u003c/pre\u003e\r\n\r\n\u003cp\u003eV případě, že spustíte další aplikaci pomocí forever a chcete, aby se také spustila při restartu VPS, musíte přidat do výše uvedeného souboru další řádek, např.:\u003c/p\u003e\r\n\r\n\u003cpre\u003e\u003ccode class=\"bash\"\u003eforever start --spinSleepTime 10000 --sourceDir /var/www/aplikace2 aplikace2.js \u003e\u003e /var/www/aplikace2/log.txt 2\u003e\u00261\u003c/code\u003e\u003c/pre\u003e\r\n\r\n\u003cp\u003eA to je v podstatě vše. Pokud vás zajímá nginx, ...\u003c/p\u003e\r\n\r\n\u003ch2\u003eReference\u003c/h2\u003e\r\n\u003col\u003e\r\n\u003cli\u003e\u003ca href=\"http://samwize.com/2014/05/20/installing-multiple-node-apps-on-vps/\"\u003ehttp://samwize.com/2014/05/20/installing-multiple-node-apps-on-vps/\u003c/a\u003e\u003c/li\u003e\r\n\u003c/ol\u003e","removed":false,"userId":"Emil Cieslar","datetime":{"$date":"2015-10-14T12:19:29.233Z"},"__v":0,"labelIds":[{"$oid":"561e5ad2bdff7b611262766d"},{"$oid":"561e5adebdff7b611262766e"}]}
{"_id":{"$oid":"5620c2b29068ea0a5147136f"},"name":"Handlebars iterátor","nameUrl":"handlebars-iterator","subheading":"Jak funguje each iterátor v handlebars","body":"\u003cp\u003eVzhledem k tomu, že tento web slouží také jako manuál pro mě a diář věcí, na které jsem narazil, tak tady mám takovou maličkost, se kterou jsem se už několikrát setkal při používání template enginu handlebars a způsobila mi nemalou bolest hlavy.\u003c/p\u003e\r\n\r\n\u003cp\u003eVždy když používám \u003cspan class=\"label label-default\"\u003e{{#each promenna}}...{{/each}}\u003c/span\u003e zapomenu na to, že uvnitř tohoto bloku se dostávám do jiné úrovně proměnné. V praxi to znamená, že když například projíždím pomocí \u003cspan class=\"label label-default\"\u003eeach\u003c/span\u003e pole \u003cspan class=\"label label-default\"\u003eusers\u003c/span\u003e, uvnitř \u003cspan class=\"label label-default\"\u003eeach\u003c/span\u003e už jsem uprostřed pole \u003cspan class=\"label label-default\"\u003eusers\u003c/span\u003e a adresuji už nižší úroveň. Kdybych chtěl adresovat proměnnou v jiné úrovni, musím použít \u003cspan class=\"label label-default\"\u003e../\u003c/span\u003e. Pojďme se podívat na příklad.\u003c/p\u003e\r\n\r\n\u003cp\u003eTak například máme pole uživatelů \u003cspan class=\"label label-default\"\u003eusers\u003c/span\u003e, které má více úrovní a vypadá v json následovně. Jako bonus k tomu máme ještě jednu proměnnou s dnešním datem \u003cspan class=\"label label-default\"\u003edate\u003c/span\u003e\u003c/p\u003e\r\n\r\n\u003cpre\u003e\u003ccode class=\"js\"\u003eusers = [\r\n\u0009user: {\r\n\u0009\u0009name: 'Emil Cieslar',\r\n\u0009\u0009age: 26\r\n\u0009},\r\n\u0009user: {\r\n\u0009\u0009name: 'Karel Veselý',\r\n\u0009\u0009age: 30\r\n\u0009}\r\n]\r\n\r\ndate = '15/10/2015'\u003c/code\u003e\u003c/pre\u003e\r\n\r\n\u003cp\u003eTakové pole budeme iterovat pomocí handlebars \u003cspan class=\"label label-default\"\u003eeach\u003c/span\u003e.\u003c/p\u003e\r\n\r\n\u003cpre\u003e\u003ccode class=\"js\"\u003e{{#each users}}\r\n\u0009Jméno: {{user.name}}\r\n{{/each}}\u003c/code\u003e\u003c/pre\u003e\r\n\r\n\r\n\u003cp\u003ePokud bychom chtěli uvnitř \u003cspan class=\"label label-default\"\u003eeach\u003c/span\u003e vypsat ještě jinou proměnnou, která je mimo rozsah této proměnné, museli bychom použít \u003cspan class=\"label label-default\"\u003e../\u003c/span\u003e jako v následujícím příkladu.\u003c/p\u003e\r\n\r\n\u003cpre\u003e\u003ccode class=\"js\"\u003e{{#each users}}\r\n\u0009Jméno: {{user.name}}\u003cbr\u003e\r\n\u0009Dnešní datum: {{../date}} \r\n{{/each}}\u003c/code\u003e\u003c/pre\u003e\r\n\r\n\u003cp\u003eVždy na toto zapomenu a pak se divím proč je ta proměnná prázdná. Někdy mi to chvíli trvá, než mi to dojde. Začátky v handlebars jsou někdy krušné. Hodně štěstí při kódování.\u003c/p\u003e","removed":false,"labelIds":[{"$oid":"561e5ad2bdff7b611262766d"},{"$oid":"561e5adebdff7b611262766e"},{"$oid":"5620c9a6fb9f4700b1bc7939"}],"userId":"Emil Cieslar","datetime":{"$date":"2015-10-16T09:26:10.097Z"},"__v":0}
